In [14]:
# For loading huge amount of data into mysql in seconds we used the following 
#query
# LOAD DATA LOCAL INFILE 'C:/Users/python2/My_Final_Projects/data_practice/book.csv'
# INTO TABLE covid
# CHARACTER SET UTF8
# FIELDS TERMINATED BY ','
# LINES TERMINATED BY '\r\n'
# IGNORE 1 LINES;

#query2
# show global variables like 'local_infile';

# set global local_infile = True;
 
#adding  to edit connection in advanced->other section
# AllowLoadLocalInfile=true
# OPT_LOCAL_INFILE=1

#should look
# AllowLoadLocalInfile=true
# DbSqlEditor:LastDefaultSchema=base
# OPT_LOCAL_INFILE=1
# OPT_READ_TIMEOUT=300
# lastConnected=1671189390
# serverVersion=8.0.31

# And run mysql as an admin as my command prompt is run like this

# MYSQL

In [ ]:
#install packages 

#!pip3 install pymysql
#!pip3 install ipython-sql
#!pip3 install mysqlclient

In [1]:
#importing  

import mysql.connector
import pandas as pd  
%load_ext sql

In [21]:
#reading database(not preferable method)
''' db_name = 'base'
db_host = '127.0.0.1'
db_user = 'root'
db_pass  = 'qwe123' 

try:
    
    conn = mysql.connector.connect(host = db_host,
                       port = int(3305),
                       user = db_user,
                       password = db_pass,
                       db = db_name)
    conn.cursor()
except e:
    print(e)
    
if conn:
    print("connected")
    
    
import warnings
warnings.filterwarnings('ignore')

df = pd.read_sql_query('SELECT * FROM data_2020', conn)
df.head()'''

' db_name = \'base\'\ndb_host = \'127.0.0.1\'\ndb_user = \'root\'\ndb_pass  = \'qwe123\' \n\ntry:\n    \n    conn = mysql.connector.connect(host = db_host,\n                       port = int(3305),\n                       user = db_user,\n                       password = db_pass,\n                       db = db_name)\n    conn.cursor()\nexcept e:\n    print(e)\n    \nif conn:\n    print("connected")\n    \n    \nimport warnings\nwarnings.filterwarnings(\'ignore\')\n\ndf = pd.read_sql_query(\'SELECT * FROM data_2020\', conn)\ndf.head()'

In [2]:
#Load with sql ext -> database  

%sql mysql+mysqldb://root:qwe123@127.0.0.1:3305/base

In [3]:
sel_query = %sql SELECT count(*) FROM covid WHERE location = 'Azerbaijan' LIMIT 10
#sel_query = pd.DataFrame(sel_query)
sel_query

 * mysql+mysqldb://root:***@127.0.0.1:3305/base
1 rows affected.

[(1019,)]

In [6]:
#%sql SELECT  *  from covid  LIMIT 10
azerb_perc = %sql SELECT location, d_date,total_cases_per_million, new_cases, new_deaths, (new_deaths /new_cases) * 100 as perc_of_death \
from covid  where location like '%Azerba%' ORDER BY 6  DESC LIMIT 10
azerb_perc

 * mysql+mysqldb://root:***@127.0.0.1:3305/base
10 rows affected.

[('Azerbaijan', '5/29/2022', 76535, 1, 1, Decimal('100.0000')),
 ('Azerbaijan', '11/14/2022', 79525, 4, 1, Decimal('25.0000')),
 ('Azerbaijan', '3/13/2020', 1, 4, 1, Decimal('25.0000')),
 ('Azerbaijan', '3/22/2022', 76418, 34, 7, Decimal('20.5882')),
 ('Azerbaijan', '1/25/2021', 22111, 57, 11, Decimal('19.2982')),
 ('Azerbaijan', '3/28/2022', 76439, 16, 3, Decimal('18.7500')),
 ('Azerbaijan', '3/25/2020', 9, 6, 1, Decimal('16.6667')),
 ('Azerbaijan', '4/4/2022', 76469, 6, 1, Decimal('16.6667')),
 ('Azerbaijan', '3/14/2022', 76348, 53, 7, Decimal('13.2075')),
 ('Azerbaijan', '6/7/2021', 32317, 32, 4, Decimal('12.5000'))]

In [8]:
azerb_most_infect = %sql SELECT location, d_date, total_cases_per_million from covid where location='Azerbaijan' ORDER BY 3 DESC LIMIT 10 
azerb_most_infect

 * mysql+mysqldb://root:***@127.0.0.1:3305/base
10 rows affected.

[('Azerbaijan', '12/14/2022', 79651),
 ('Azerbaijan', '12/13/2022', 79642),
 ('Azerbaijan', '12/12/2022', 79636),
 ('Azerbaijan', '12/11/2022', 79635),
 ('Azerbaijan', '12/10/2022', 79629),
 ('Azerbaijan', '12/9/2022', 79624),
 ('Azerbaijan', '12/8/2022', 79618),
 ('Azerbaijan', '12/7/2022', 79613),
 ('Azerbaijan', '12/6/2022', 79607),
 ('Azerbaijan', '12/5/2022', 79601)]

In [22]:
    %sql  SELECT distinct(location), CAST(population_density AS UNSIGNED) as population_density from covid  ORDER BY 2 DESC LIMIT 10

 * mysql+mysqldb://root:***@127.0.0.1:3305/base
10 rows affected.

[('Macao', 20546),
 ('Monaco', 19347),
 ('Singapore', 7915),
 ('Hong Kong', 7039),
 ('Gibraltar', 3457),
 ('Bahrain', 1935),
 ('Maldives', 1454),
 ('Malta', 1454),
 ('Bermuda', 1308),
 ('Bangladesh', 1265)]

In [179]:
 
#Same function 
%sql  SELECT ANY_VALUE(location) as location, max(ANY_VALUE(total_deaths)) as deaths, ANY_VALUE(d_date) as d_date\
   from covid WHERE location !='High Income' and location !='Upper middle income' group by 1  ORDER BY 2 DESC LIMIT 10

 * mysql+mysqldb://root:***@127.0.0.1:3305/base
10 rows affected.

[('World', 6658635, '1/22/2020'),
 ('Europe', 1989605, '1/23/2020'),
 ('North America', 1544220, '1/22/2020'),
 ('Asia', 1508127, '1/22/2020'),
 ('Lower middle income', 1342856, '1/22/2020'),
 ('South America', 1337723, '2/22/2020'),
 ('European Union', 1181917, '1/23/2020'),
 ('United States', 1086199, '1/22/2020'),
 ('Brazil', 691449, '2/26/2020'),
 ('India', 530663, '1/30/2020')]

In [207]:
azerb_perc = %sql SELECT location, d_date,total_cases_per_million, new_cases, new_deaths, (new_deaths /new_cases) * 100 as perc_of_death \
from covid  where location like '%Azerba%' ORDER BY 6  DESC LIMIT 10
azerb_perc

 * mysql+mysqldb://root:***@127.0.0.1:3305/base
10 rows affected.

[('Azerbaijan', '5/29/2022', 76535, 1, 1, Decimal('100.0000')),
 ('Azerbaijan', '11/14/2022', 79525, 4, 1, Decimal('25.0000')),
 ('Azerbaijan', '3/13/2020', 1, 4, 1, Decimal('25.0000')),
 ('Azerbaijan', '3/22/2022', 76418, 34, 7, Decimal('20.5882')),
 ('Azerbaijan', '1/25/2021', 22111, 57, 11, Decimal('19.2982')),
 ('Azerbaijan', '3/28/2022', 76439, 16, 3, Decimal('18.7500')),
 ('Azerbaijan', '3/25/2020', 9, 6, 1, Decimal('16.6667')),
 ('Azerbaijan', '4/4/2022', 76469, 6, 1, Decimal('16.6667')),
 ('Azerbaijan', '3/14/2022', 76348, 53, 7, Decimal('13.2075')),
 ('Azerbaijan', '6/7/2021', 32317, 32, 4, Decimal('12.5000'))]

In [204]:
azerb_perc = %sql SELECT location, d_date, (new_deaths /new_cases) * 100 as perc_of_death \
from covid   ORDER BY 3 DESC LIMIT 10
azerb_perc

 * mysql+mysqldb://root:***@127.0.0.1:3305/base
10 rows affected.

[('Sudan', '3/7/2022', Decimal('1701.7857')),
 ('United Kingdom', '7/2/2020', Decimal('1525.0000')),
 ('Kazakhstan', '1/4/2022', Decimal('1500.0000')),
 ('Fiji', '4/13/2022', Decimal('933.3333')),
 ('Antigua and Barbuda', '11/22/2021', Decimal('900.0000')),
 ('Netherlands', '2/22/2022', Decimal('900.0000')),
 ('Sudan', '8/12/2021', Decimal('675.0000')),
 ('Nepal', '2/24/2021', Decimal('658.5106')),
 ('North Korea', '5/14/2022', Decimal('600.0000')),
 ('Liberia', '8/17/2021', Decimal('600.0000'))]

# SQL

In [ ]:
http://localhost:8889/notebooks/My_Final_Projects/Sql_pr.ipynb 
http://localhost:8889/notebooks/task.ipynb
http://localhost:8889/notebooks/Final_project/Week4.ipynb
http://localhost:8889/notebooks/sql_magic.ipynb 
http://localhost:8889/notebooks/sql_magic2.ipynb

# SQLLite

In [1]:
import csv, sqlite3, os 
import pandas as pd

con = sqlite3.connect("Exercise.db")
%load_ext sql
%sql sqlite:///Exercise.db
con

In [2]:
filename = [filenames  for filenames in os.listdir('../')][3:6]
filename[0]
filename[1]
filename[2]
filename

['ChicagoCensusData.csv', 'ChicagoCrimeData.csv', 'ChicagoPublicSchools.csv']

In [3]:
filename[0]

'ChicagoCensusData.csv'

In [4]:
all_convert = pd.DataFrame()

for file in filename:
    df1= pd.read_csv('../'+ filename[0])
    df2= pd.read_csv('../'+ filename[1])
    df3= pd.read_csv('../'+ filename[2])

    all_convert = pd.concat([all_convert, df1, df2, df3])
    #print(all_convert)

In [5]:
df1.head()

,COMMUNITY_AREA_NUMBER,COMMUNITY_AREA_NAME,PERCENT_OF_HOUSING_CROWDED,PERCENT_HOUSEHOLDS_BELOW_POVERTY,PERCENT_AGED_16__UNEMPLOYED,PERCENT_AGED_25__WITHOUT_HIGH_SCHOOL_DIPLOMA,PERCENT_AGED_UNDER_18_OR_OVER_64,PER_CAPITA_INCOME,HARDSHIP_INDEX
0,1.0,Rogers Park,7.7,23.6,8.7,18.2,27.5,23939,39.0
1,2.0,West Ridge,7.8,17.2,8.8,20.8,38.5,23040,46.0
2,3.0,Uptown,3.8,24.0,8.9,11.8,22.2,35787,20.0
3,4.0,Lincoln Square,3.4,10.9,8.2,13.4,25.5,37524,17.0
4,5.0,North Center,0.3,7.5,5.2,4.5,26.2,57123,6.0

In [6]:
df2.head()

,ID,CASE_NUMBER,DATE,BLOCK,IUCR,PRIMARY_TYPE,DESCRIPTION,LOCATION_DESCRIPTION,ARREST,DOMESTIC,...,DISTRICT,WARD,COMMUNITY_AREA_NUMBER,FBICODE,X_COORDINATE,Y_COORDINATE,YEAR,LATITUDE,LONGITUDE,LOCATION
0,3512276,HK587712,2004-08-28,047XX S KEDZIE AVE,890,THEFT,FROM BUILDING,SMALL RETAIL STORE,False,False,...,9,14.0,58.0,6,1155838.0,1873050.0,2004,41.807440,-87.703956,"(41.8074405, -87.703955849)"
1,3406613,HK456306,2004-06-26,009XX N CENTRAL PARK AVE,820,THEFT,$500 AND UNDER,OTHER,False,False,...,11,27.0,23.0,6,1152206.0,1906127.0,2004,41.898280,-87.716406,"(41.898279962, -87.716405505)"
2,8002131,HT233595,2011-04-04,043XX S WABASH AVE,820,THEFT,$500 AND UNDER,NURSING HOME/RETIREMENT HOME,False,False,...,2,3.0,38.0,6,1177436.0,1876313.0,2011,41.815933,-87.624642,"(41.815933131, -87.624642127)"
3,7903289,HT133522,2010-12-30,083XX S KINGSTON AVE,840,THEFT,FINANCIAL ID THEFT: OVER $300,RESIDENCE,False,False,...,4,7.0,46.0,6,1194622.0,1850125.0,2010,41.743665,-87.562463,"(41.743665322, -87.562462756)"
4,10402076,HZ138551,2016-02-02,033XX W 66TH ST,820,THEFT,$500 AND UNDER,ALLEY,False,False,...,8,15.0,66.0,6,1155240.0,1860661.0,2016,41.773455,-87.706480,"(41.773455295, -87.706480471)"

In [7]:
df3.head()

,School_ID,NAME_OF_SCHOOL,"Elementary, Middle, or High School",Street_Address,City,State,ZIP_Code,Phone_Number,Link,Network_Manager,...,Freshman_on_Track_Rate__,X_COORDINATE,Y_COORDINATE,Latitude,Longitude,COMMUNITY_AREA_NUMBER,COMMUNITY_AREA_NAME,Ward,Police_District,Location
0,610038,Abraham Lincoln Elementary School,ES,615 W Kemper Pl,Chicago,IL,60614,(773) 534-5720,http://schoolreports.cps.edu/SchoolProgressRep...,Fullerton Elementary Network,...,NDA,1171699.458,1915829.428,41.924497,-87.644522,7,LINCOLN PARK,43,18,"(41.92449696, -87.64452163)"
1,610281,Adam Clayton Powell Paideia Community Academy ...,ES,7511 S South Shore Dr,Chicago,IL,60649,(773) 535-6650,http://schoolreports.cps.edu/SchoolProgressRep...,Skyway Elementary Network,...,NDA,1196129.985,1856209.466,41.760324,-87.556736,43,SOUTH SHORE,7,4,"(41.76032435, -87.55673627)"
2,610185,Adlai E Stevenson Elementary School,ES,8010 S Kostner Ave,Chicago,IL,60652,(773) 535-2280,http://schoolreports.cps.edu/SchoolProgressRep...,Midway Elementary Network,...,NDA,1148427.165,1851012.215,41.747111,-87.731702,70,ASHBURN,13,8,"(41.74711093, -87.73170248)"
3,609993,Agustin Lara Elementary Academy,ES,4619 S Wolcott Ave,Chicago,IL,60609,(773) 535-4389,http://schoolreports.cps.edu/SchoolProgressRep...,Pershing Elementary Network,...,NDA,1164504.290,1873959.199,41.809757,-87.672145,61,NEW CITY,20,9,"(41.8097569, -87.6721446)"
4,610513,Air Force Academy High School,HS,3630 S Wells St,Chicago,IL,60609,(773) 535-1590,http://schoolreports.cps.edu/SchoolProgressRep...,Southwest Side High School Network,...,91.8,1175177.622,1880745.126,41.828146,-87.632794,34,ARMOUR SQUARE,11,9,"(41.82814609, -87.63279369)"

In [27]:
chicago_census_data = df1.to_sql("chicago_census_data", con, if_exists='replace', index=False,method="multi")
chicago_crime_data = df2.to_sql("chicago_crime_data", con, if_exists='replace', index=False,method="multi")
chicago_pub_school = df3.to_sql("chicago_pub_school", con, if_exists='replace', index=False, chunksize = 1000)

In [34]:
%sql SELECT * FROM chicago_census_data LIMIT 1

 * sqlite:///Exercise.db
Done.

[(1.0, 'Rogers Park', 7.7, 23.6, 8.7, 18.2, 27.5, 23939, 39.0)]

In [32]:
%sql SELECT * FROM chicago_pub_school LIMIT 1

 * sqlite:///Exercise.db
Done.

[(610038, 'Abraham Lincoln Elementary School', 'ES', '615 W Kemper Pl', 'Chicago', 'IL', 60614, '(773) 534-5720', 'http://schoolreports.cps.edu/SchoolProgressReport_Eng/Spring2011Eng_610038.pdf', 'Fullerton Elementary Network', 'NORTH-NORTHWEST SIDE COLLABORATIVE', 'No', 'Standard', 'Not on Probation', 'Level 1', 'Yes', 'Very Strong', 99.0, 'Very Strong', '99', 'Strong', 74.0, 'Strong', 66.0, 'Weak', '65', 'Strong', '70', 'Strong', '56', 'Average', '47', '96.00%', 2.0, '96.40%', '95.80%', '80.1', '43.3', '89.6', '84.9', '60.7', '62.6', '81.9', '85.2', '52', '62.4', '66.3', '77.9', 69.7, 64.4, 0.2, 0.9, 'Yellow', 'Green', '67.1', '54.5', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 'NDA', 813, 33, 'NDA', 1171699.458, 1915829.428, 41.92449696, -87.64452163, 7, 'LINCOLN PARK', 43, 18, '(41.92449696, -87.64452163)')]

In [35]:
%sql SELECT * FROM chicago_crime_data LIMIT 1

 * sqlite:///Exercise.db
Done.

[(3512276, 'HK587712', '2004-08-28', '047XX S KEDZIE AVE', '890', 'THEFT', 'FROM BUILDING', 'SMALL RETAIL STORE', 0, 0, 911, 9, 14.0, 58.0, '6', 1155838.0, 1873050.0, 2004, 41.8074405, -87.70395585, '(41.8074405, -87.703955849)')]

In [36]:
%sql SELECT name  FROM  sqlite_schema WHERE  type ='table'

 * sqlite:///Exercise.db
Done.

[('chicago_census_data',), ('chicago_crime_data',), ('chicago_pub_school',)]

In [38]:
df1.columns

Index(['COMMUNITY_AREA_NUMBER', 'COMMUNITY_AREA_NAME',
       'PERCENT_OF_HOUSING_CROWDED', 'PERCENT_HOUSEHOLDS_BELOW_POVERTY',
       'PERCENT_AGED_16__UNEMPLOYED',
       'PERCENT_AGED_25__WITHOUT_HIGH_SCHOOL_DIPLOMA',
       'PERCENT_AGED_UNDER_18_OR_OVER_64', 'PER_CAPITA_INCOME',
       'HARDSHIP_INDEX'],
      dtype='object')

In [39]:
%sql select count(*) as total_number_of_crime_cases from chicago_crime_data

 * sqlite:///Exercise.db
Done.

[(533,)]

In [43]:
# %sql DROP TABLE chicago_pub_school
# %sql DROP TABLE chicago_census_data
# %sql DROP TABLE  chicago_crime_data

In [48]:
#Problem 3: List all case numbers for crimes involving minors? children are not considered minors for the purposes of crime analysis)
%sql select case_number from chicago_crime_data where primary_type = 'offense involving children' or description like '%minor%'

 * sqlite:///Exercise.db
Done.

[('HL266884',), ('HK238408',)]

In [52]:
#List all kidnapping crimes involving a child?
%sql select id, case_number, primary_type from chicago_crime_data where primary_type='KIDNAPPING'

 * sqlite:///Exercise.db
Done.

[(5276766, 'HN144152', 'KIDNAPPING')]

In [53]:
%sql SELECT DISTINCT(primary_type) from chicago_crime_data

 * sqlite:///Exercise.db
Done.

[('THEFT',),
 ('BATTERY',),
 ('CRIMINAL DAMAGE',),
 ('NARCOTICS',),
 ('OTHER OFFENSE',),
 ('ASSAULT',),
 ('BURGLARY',),
 ('MOTOR VEHICLE THEFT',),
 ('DECEPTIVE PRACTICE',),
 ('ROBBERY',),
 ('CRIMINAL TRESPASS',),
 ('PROSTITUTION',),
 ('WEAPONS VIOLATION',),
 ('PUBLIC PEACE VIOLATION',),
 ('OFFENSE INVOLVING CHILDREN',),
 ('CRIM SEXUAL ASSAULT',),
 ('SEX OFFENSE',),
 ('INTERFERENCE WITH PUBLIC OFFICER',),
 ('GAMBLING',),
 ('LIQUOR LAW VIOLATION',),
 ('ARSON',),
 ('HOMICIDE',),
 ('KIDNAPPING',),
 ('INTIMIDATION',),
 ('STALKING',),
 ('OBSCENITY',),
 ('CONCEALED CARRY LICENSE VIOLATION',),
 ('PUBLIC INDECENCY',),
 ('NON-CRIMINAL',),
 ('OTHER NARCOTIC VIOLATION',),
 ('HUMAN TRAFFICKING',),
 ('NON - CRIMINAL',),
 ('RITUALISM',),
 ('NON-CRIMINAL (SUBJECT SPECIFIED)',),
 ('DOMESTIC VIOLENCE',)]

In [54]:
%sql select primary_type as crime_recorded_atschool from  chicago_crime_data where location_description like '%SCHOOL%'

 * sqlite:///Exercise.db
Done.

[('BATTERY',),
 ('BATTERY',),
 ('BATTERY',),
 ('BATTERY',),
 ('BATTERY',),
 ('CRIMINAL DAMAGE',),
 ('NARCOTICS',),
 ('NARCOTICS',),
 ('ASSAULT',),
 ('CRIMINAL TRESPASS',),
 ('PUBLIC PEACE VIOLATION',),
 ('PUBLIC PEACE VIOLATION',)]